"(Not You?)|Login - Clickable text letting user log in as a different user" = "(ไม่ใช่คุณใช่ไหม?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend is Nearby|Title of megaphone to encourage user to share location." = "เพื่อน 1 คนอยู่ใกล้เคียง";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 วัน";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 ชั่วโมง";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 นาที";

"1d|short indicator that a user was active 1 day ago" = "1 วัน";

"1h|short indicator that a user was active 1 hour ago" = "1 ชม.";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "ถึง 1 นาทีแล้ว: ปล่อยเพื่อส่ง";

"1m|short indicator that a user was active 1 minute ago" = "1 นาที";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 วัน";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 ชั่วโมง";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 นาที";

"A new version of Messenger is available.|New version title" = "มี Messenger เวอร์ชันใหม่ให้บริการ";

"Activation Code|placeholder text for activation code field" = "รหัสเปิดใช้งาน";

"Activation Request Failed|" = "คำขอเปิดใช้งานล้มเหลว";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "ใช้งานอยู่ในขณะนี้ (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "เพิ่มรายการโปรด";

"Add More People|button for adding people to the conversation" = "เพิ่มบุคคลอีก";

"Add More People|title for add members page" = "เพิ่มบุคคลอีก";

"Add More People|title for add people page" = "เพิ่มบุคคลอีก";

"Add To Conversation|text to show in the add people button" = "เพิ่มในการสนทนา";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "เพิ่มในผู้ติดต่อที่มีอยู่";

"Add|generic add button" = "เพิ่ม";

"Adding...|adding progress text" = "กำลังเพิ่ม...";

"Advanced Settings|text for advanced settings button" = "การตั้งค่าขั้นสูง";

"Advanced|title for advanced settings page" = "ขั้นสูง";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "ปิดการเตือนจนถึง %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "ปิดการเตือน 1 ชั่วโมง";

"Alerts Off|Indicates that alerts are off" = "ปิดการเตือน";

"Alerts On|Indicates that alerts are on" = "เปิดการเตือน";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "การแจ้งเตือนทั้งหมดจะปิดเป็นเวลา 8 ชม.";

"All notifications are off.|Mute warning display on thread list" = "การแจ้งเตือนทั้งหมดปิดอยู่";

"Answer|Text for button that accepts a call" = "รับสาย";

"Archive Thread|Button label that will archive the thread" = "เก็บบทสนทนาถาวร";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "คุณแน่ใจหรือไม่ว่าคุณต้องการลบชื่อการสนทนานี้?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "คุณแน่ใจหรือไม่ว่าคุณต้องการออกจากการสนทนานี้? คุณจะไม่ได้รับข้อความใหม่อีกต่อไป";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "คุณแน่ใจหรือไม่?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "แนบรูปภาพ";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "แนบสื่อ";

"Auto Send|Auto send label" = "ส่งโดยอัตโนมัติ";

"Back|generic nav bar back button" = "กลับ";

"Bing Image Search|" = "ค้นหารูปภาพขนาดใหญ่";

"Call Ended|End call message in non-error case" = "วางสายแล้ว";

"Call Ended|String shown when the call ends" = "วางสายแล้ว";

"Call Failed|End call message in error case" = "ไม่สามารถโทรได้";

"Call %@|action sheet option for calling a phone number" = "โทรถึง %1$@";

"Camera|Button label for attaching a photo from the camera" = "กล้อง";

"Cancel|Title for generic Cancel button." = "ยกเลิก";

"Choose Photo|action sheet option for choosing a photo from photo library" = "เลือกรูปภาพ";

"Clear|prompt to clear all unsent messages" = "ล้าง";

"Clearing...|Progress text shown while clearing the image for a thread" = "กำลังล้าง...";

"Clearing...|Progress text shown while clearing the name for a thread" = "กำลังล้าง...";

"Close active chat|Button to close an active chat" = "ปิดการแชทที่สนทนาอยู่";

"Comment|Comment button title" = "ความคิดเห็น";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "เขียนข้อความถึง %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "เขียนข้อความถึง %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "ยืนยันหมายเลข";

"Connecting|Text shown on call screen while connecting a call" = "กำลังเชื่อมต่อ";

"Connection Failed|Alert title when connection failed" = "การเชื่อมต่อล้มเหลว";

"Connection Lost|End call message in connection lost case" = "การเชื่อมต่อขาดหาย";

"Contact Info|Title of the canonical thread info page." = "ข้อมูลติดต่อ";

"Contacting|Text shown on call screen while contacting another party" = "กำลังต่อสาย";

"Continue|Login - Login Button Title for Keychain Login" = "ทำต่อ";

"Conversation Name|placeholder text in conversation name textfield" = "ชื่อการสนทนา";

"Copy Link|Option that pops out after long press on a link in message thread." = "คัดลอกลิงก์";

"Copy|action sheet option for copying a string to the clipboard" = "คัดลอก";

"Could not add new members. Please try again.|message for failing to add members dialog" = "ไม่สามารถเพิ่มสมาชิกใหม่ โปรดลองอีกครั้ง";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "ไม่สามารถเรียกดูสถานะได้";

"Countries|Title for country picker" = "ประเทศ";

"Country|Country - Country placeholder text" = "ประเทศ";

"Create Group Conversation|button for adding people to the canonical conversation" = "สร้างกลุ่มการสนทนา";

"Create New Contact|action sheet option for creating a new contact" = "สร้างผู้ติดต่อใหม่";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "กำลังอยู่ในสายในขณะนี้";

"Customize Notification Settings|User education for how to configure conversation alerts" = "ปรับการตั้งค่าการแจ้งเตือนให้เหมาะสม";

"Decline|Text for button that declines a call" = "ปฏิเสธ";

"Delete Conversation Name|alert title for deleting conversation name" = "ลบชื่อการสนทนา";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "ต้องการลบข้อความ? คุณจะไม่สามารถยกเลิกการกระทำนี้ได้";

"Delete|Button to accept deleting the name of a conversation" = "ลบ";

"Delete|Label for button to delete previous character" = "ลบ";

"Delete|button text for deleting a message" = "ลบ";

"Delete|button text for removing an unsent message" = "ลบ";

"Details|title for message details page" = "รายละเอียด";

"Discover Who's Nearby|Title of NUX to encourage user to share location." = "ค้นพบว่าใครอยู่ใกล้เคียง";

"Discover which friends are nearby and let them know you're around.|Description of megaphone to encourage user to share location." = "ค้นหาว่าเพื่อนคนใดอยู่ใกล้เคียงและบอกให้พวกเขาทราบว่าคุณอยู่ใกล้กัน";

"Discover who's in the area and let them know you're around.|Description of megaphone to encourage user to share location." = "ค้นหาว่าใครอยู่ในพื้นที่และบอกให้พวกเขาทราบว่าคุณอยู่ใกล้กัน";

"Dismiss|Dismiss the audio recorder" = "ยกเลิก";

"Don't Delete|Button to decline to delete the name of a conversation" = "ไม่ต้องลบ";

"Don't Save|Don't save action sheet button" = "ไม่ต้องบันทึก";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "เรียบร้อย";

"Download|Button title to download an upgrade" = "ดาวน์โหลด";

"Edit|Edit button/label title for chat divebar" = "แก้ไข";

"Email|email field placeholder on login screen" = "อีเมล";

"Empty Feedback|Title for empty feedback warning." = "คำติชมว่าง";

"Enter Code|Enter Code page title" = "ป้อนรหัส";

"Error|error title after failed to load webview" = "ข้อผิดพลาด";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "ผู้ใช้ Facebook";

"Failed to add members|title for failing to add members dialog" = "เพิ่มสมาชิกไม่สำเร็จ";

"Failed to save your settings.|error message after changing thread alert setting." = "บันทึกการตั้งค่าของคุณไม่สำเร็จ";

"Favorites|chat bar favorites header title" = "รายการโปรด";

"Free Call|Text on button that starts a messenger call" = "โทรฟรี";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "ไม่สามารถโทรฟรีได้";

"Friends of Friends|Table section header for a list of friends of friends search results" = "เพื่อนของเพื่อน";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "เพื่อนใน Messenger";

"Get Directions|action sheet option for viewing a map" = "รับเส้นทาง";

"Get Facebook Messenger|Title of a link that takes the user to download the Facebook Messenger app" = "โหลด Facebook Messenger";

"Get Started|Title for NUX" = "เริ่ม";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "ส่งคำติชมมาให้เราหรือรายงานปัญหา";

"Google Image Search|" = "ค้นหารูปภาพใน Google";

"Group Conversation|Create a group conversation divebar label" = "การสนทนาแบบกลุ่ม";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "การสนทนาแบบกลุ่ม";

"Group Info|Title of group thread info page." = "ข้อมูลกลุ่ม";

"Help|text for help button" = "วิธีใช้";

"Hold to Talk|The instruction for holding the record button and talk" = "กดค้างเพื่อพูด";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "ฉันแน่ใจ";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "หากคุณชอบใช้ %1$@ ช่วยสละเวลาเล็กน้อยเพื่อให้คะแนนการอัพเดตนี้ได้ไหม ขอบคุณ!";

"Image Search|action sheet option for choosing a photo from image search" = "การค้นหารูปภาพ";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "ใส่ตำแหน่งที่ตั้งของคุณ";

"Incomplete contact|Alert title: Newly created contact needs more information" = "ข้อมูลผู้ติดต่อไม่ครบ";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "รหัสยืนยันไม่ถูกต้อง";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "ต้องการติดตั้ง Facebook Messenger ใช่หรือไม่";

"Install Messenger to listen to this message and record your own.|The detailed message to tell user that the audio clip feature is not supported on the wilde, and then promote a link for them to download the Facebook Messenger app" = "ติดตั้ง Messenger เพื่อฟังข้อความนี้และบันทึกข้อความของคุณเอง";

"Install|Button text to install the Facebook Messenger" = "ติดตั้ง";

"Invalid Contact|Alert title: Newly created contact has invalid information" = "ผู้ติดต่อไม่ถูกต้อง";

"Invalid Country Code|alert title for invalid country code" = "รหัสประเทศไม่ถูกต้อง";

"Invalid Phone Number|alert title for invalid phone number" = "หมายเลขโทรศัพท์ไม่ถูกต้อง";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "ให้ทุกคนอยู่ในลูป";

"Last Updated: %@|last updated date in pull to refresh header" = "อัพเดตล่าสุด: %1$@";

"Learn More|Title for button to learn more about sharing location." = "เรียนรู้เพิ่มเติม";

"Leave Conversation|leave conversation button" = "ออกจากการสนทนา";

"Leave conversation?|confirmation dialog title for leaving a thread" = "ออกจากการสนทนาหรือไม่?";

"Leave|Button title for leaving a thread" = "ออก";

"Leaving...|Progress text shown while leaving a thread" = "กำลังออก...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "อนุญาตให้บุคคลในการสนทนานี้ทราบว่าคุณอยู่ที่ไหน";

"Licenses|Licenses screen title" = "ใบอนุญาต";

"Licenses|text for licenses button" = "ใบอนุญาต";

"Like|Like button title" = "ถูกใจ";

"Load Earlier Messages|message for loading earlier messages" = "โหลดข้อความก่อนหน้า";

"Loading...|Message presented while waiting for content to load." = "กำลังโหลด...";

"Locating You...|Message presented when waiting for an accurate location fix." = "กำลังระบุตำแหน่งของคุณ...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "ตำแหน่งที่ตั้งถูกปิดใช้งาน";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "ตำแหน่งที่ตั้งถูกปิดสำหรับการสนทนานี้";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "บริการตำแหน่งที่ตั้งปิดอยู่ เปิดเพื่อให้ผู้อื่นในการสนทนานี้ทราบว่าคุณอยู่ที่ไหน";

"Location services are on|Title of location NUX when user has enabled location services." = "บริการตำแหน่งที่ตั้งเปิดอยู่";

"Log In to Facebook|Login - Login Button Title for password login" = "เข้าสู่ระบบ Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "เข้าสู่ระบบในชื่อ %1$@";

"Login Approval Required|title of login approval dialog" = "ต้องป้อนรหัสอนุมัติการเข้าสู่ระบบ";

"Login Failed|Invalid login alert title" = "ไม่สามารถเข้าสู่ระบบได้";

"Map|title of map tab" = "แผนที่";

"Mark as Unread|Button label that will mark the thread as unread" = "ทำเครื่องหมายว่ายังไม่ได้อ่าน";

"Meet Friends on the Go|Title of megaphone to encourage user to share location." = "พบเพื่อนขณะเดินทาง";

"Message|divebar message button title" = "ส่งข้อความ";

"Messages|Messenger module display name" = "ข้อความ";

"Messages|name of the app with Facebook brand" = "ข้อความ";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "เพื่อนคนอื่นๆ (%1$d)";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "เพื่อนคนอื่นๆ (%1$d)";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "เพื่อนที่ออนไลน์เพิ่มเติม";

"NOTE: People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "หมายเหตุ: บุคคลที่คุณเพิ่มจะเห็นข้อความก่อนหน้าในการสนทนานี้";

"Name is Too Long|alert title for long conversation name" = "ชื่อยาวเกินไป";

"Name|Placeholder text: Name of new contact" = "ชื่อ";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "ไม่พลาดทุกข้อความ";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "คุณจะไม่พลาดข้อความจากเพื่อนอีกต่อไป";

"New Contact|Button title: Create a new contact" = "ผู้ติดต่อใหม่";

"New Message|Title of screen shown when user is composing a new message" = "ข้อความใหม่";

"New version available|Title of alert displayed when new version is available" = "มีเวอร์ชันใหม่ให้บริการ";

"Next|Generic button to move to next item" = "ถัดไป";

"Next|button label for moving to the next screen" = "ถัดไป";

"No Message|dialog title for when user tries to send an empty message" = "ไม่มีข้อความ";

"No Recipients|dialog title for when user tries to send to no recipients" = "ไม่มีผู้รับ";

"No Results|Accessibility label describing a contacts search result with no results" = "ไม่พบผลลัพธ์";

"No locations shared recently.|message on map view when no location has been shared recently" = "ไม่มีตำแหน่งที่ตั้งที่แชร์เมื่อเร็วๆ นี้";

"No response.|Error reported when no response is received from the server" = "ไม่มีการตอบสนอง";

"No, Thanks|Label on button for user to decline to rate the app" = "ไม่ ขอบคุณ";

"Nobody will see exactly where you are.|Explanation to let user know sharing location will not expose his exact location." = "จะไม่มีใครเห็นตำแหน่งที่แท้จริงของคุณ";

"Not Now|Button text to temporarily ignore the installation message" = "ไม่ใช่ตอนนี้";

"Not Now|Not now alert popup button" = "ไม่ใช่ตอนนี้";

"Not Now|Title of button to not share location for now." = "ไม่ใช่ตอนนี้";

"Not Now|button label for deferring enabling push notifications" = "ไม่ใช่ตอนนี้";

"Not now|Button title to decline an upgrade" = "ไม่ใช่ตอนนี้";

"Notifications for This Conversation|Title for per-thread notification settings" = "การแจ้งเตือนสำหรับการสนทนานี้";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "การแจ้งเตือนสำหรับการสนทนานี้ปิดอยู่";

"Notifications|Label for enabling/disabling notification" = "การแจ้งเตือน";

"OK|Title for generic OK button." = "ตกลง";

"Off Until %@|Short string for indicating that alerts are off until X time" = "ปิดจนถึง %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "ปิดเป็นเวลา 1 ชั่วโมง";

"Off|Short string for indicating that alerts are off" = "ปิด";

"On|Short string for indicating that alerts are on" = "เปิด";

"Open in Maps|action sheet option for opening an address in the Maps app" = "เปิดในแผนที่";

"Password|password field placeholder on login screen" = "รหัสผ่าน";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "ผู้ที่อยู่ในการสนทนานี้จะสามารถเห็นตำแหน่งที่ตั้งของคุณในแผนที่ได้";

"People|Section title for list of thread participants." = "บุคคล";

"People|title of people tab" = "บุคคล";

"Phone Number|placeholder text for phone number field" = "หมายเลขโทรศัพท์";

"Phone or Email|Placeholder text: Phone or email address of new contact" = "โทรศัพท์หรืออีเมล";

"Pin friends you message most|Label when users have no favorites" = "ปักหมุดเพื่อนที่คุณส่งข้อความถึงบ่อยที่สุด";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "โปรดตรวจสอบรหัสยืนยันและลองอีกครั้ง";

"Please check your network connection and try again.|" = "โปรดตรวจสอบการเชื่อมต่อเครือข่ายและลองอีกครั้ง";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "โปรดตรวจสอบหมายเลขของคุณแล้วลองอีกครั้ง";

"Please check your number and try again.|alert message for invalid phone number" = "โปรดตรวจสอบหมายเลขของคุณแล้วลองอีกครั้ง";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "โปรดดาวน์โหลด Facebook Messenger เวอร์ชันล่าสุด";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "โปรดป้อนข้อความหรือแนบรูปภาพ";

"Please enter a phone number or email.|Alert message: Newly created contact has invalid information" = "โปรดป้อนเบอร์โทรศัพท์หรืออีเมล";

"Please enter a valid country code.|alert message for invalid country code" = "โปรดป้อนรหัสประเทที่ถูกต้อง";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "โปรดป้อนอีเมลและรหัสผ่านที่คุณใช้เพื่อเข้าสู่ระบบ Facebook";

"Please enter the person's name and contact information.|Alert message: Newly created contact needs more information" = "โปรดป้อนชื่อบุคคลและข้อมูลการติดต่อ";

"Please include a description of your problem.|Message for empty feedback warning." = "โปรดใส่คำอธิบายปัญหาของคุณ";

"Please rate the quality of your call|Prompt for call quality survey" = "โปรดให้คะแนนคุณภาพการโทรของคุณ";

"Please re-login to renew your session.|Error message for expired session" = "โปรดเข้าสู่ระบบอีกครั้งเพื่อต่ออายุเซสชัน";

"Please use a shorter conversation name.|alert message for long conversation name" = "โปรดใช้ชื่อการสนทนาที่สั้นกว่านี้";

"Preview|title for image preview screen" = "แสดงตัวอย่าง";

"Privacy & Terms|text for privacy and terms button" = "ความเป็นส่วนตัวและเงื่อนไข";

"Pull down to refresh...|message for pull down to refresh" = "กดลงเพื่อรีเฟรช...";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "การแจ้งเตือนแบบพุชปิดอยู่";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "เสียงการแจ้งเตือนแบบพุชปิดอยู่";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "การแจ้งเตือนแบบพุชปิดอยู่";

"Push up to refresh...|message for push up to refresh" = "กดขึ้นเพื่อรีเฟรช...";

"REC|The record button" = "บันทึก";

"Rate %@|Alert title for asking user to rate this app." = "ให้คะแนน %1$@";

"Rate %@|Label on button prompting user to rate the app." = "ให้คะแนน %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "ติดต่อเพื่อนไม่ว่าพวกเขาจะอยู่ในมือถือหรือเว็บ";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "ติดต่อกับเพื่อนได้ไม่ว่าจะอยู่ที่ไหน";

"Record Audio|action sheet option for recording some audio" = "บันทึกเสียง";

"Record Video|action sheet option for recording a video" = "บันทึกวิดีโอ";

"Record Voice|Button label for attaching an audio clip" = "บันทึกเสียง";

"Record|Record button for voice message" = "บันทึก";

"Record|Record button for voice recording" = "บันทึก";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "ไม่สามารถเริ่มโปรแกรมบันทึกเสียงได้";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "ยกเลิกการบันทึกเสียงแล้ว";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "ปล่อยเพื่อยกเลิกการบันทึกเสียง";

"Release to refresh...|message for releasing to refresh" = "ปล่อยปุ่มเพื่อรีเฟรช...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "เตือนฉันในภายหลัง";

"Remove Attachment|action sheet option for removing current attachment" = "ลบสิ่งที่แนบออก";

"Remove Photo|action sheet option for removing chosen photo" = "ลบรูปภาพ";

"Remove Photo|action sheet option for removing current attachment" = "ลบรูปภาพ";

"Removing...|text for removing progress" = "กำลังลบออก...";

"Report a Problem|title for give feedback or report bug" = "รายงานปัญหา";

"Resend|Resend - Resend Button Title" = "ส่งใหม่";

"Retry|generic retry button" = "ลองใหม่";

"Save Photo|action sheet option to save photo to library" = "บันทึกรูปภาพ";

"Save photo as conversation image?|" = "บันทึกรูปภาพเป็นรูปการสนทนาหรือไม่?";

"Save|" = "บันทึก";

"Saving...|Progress text shown while saving a new image for a thread" = "กำลังบันทึก...";

"Saving...|Progress text shown while saving a new name for a thread" = "กำลังบันทึก";

"Search for Friends|Accessibility label for button that toggles display of friends list/search" = "ค้นหาเพื่อน";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "ค้นหาเพื่อนเพิ่มเติม…";

"Search to add favorites|placeholder in edit favorites search bar" = "ค้นหาเพื่อเพิ่มรายการโปรด";

"Search|placeholder in search bar" = "ค้นหา";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "กำลังค้นหา...";

"See which friends are within walking distance or visiting your city, and let them know you're nearby.|Description of NUX to encourage user to share location." = "ดูว่าเพื่อนคนใดอยู้ใกล้พอที่จะเดินไปหาได้หรือกำลังอยู่ในเมืองของคุณ แล้วบอกให้พวกเขาทราบว่าคุณอยู่ใกล้เคียง";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "ทุกคนดู";

"Seen by everyone|Seen state text for when everyone has seen the message." = "ทุกคนดู";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "อ่านโดย %1$@ เมื่อ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "อ่านโดย %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "อ่านโดย %1$@";

"Seen by:|Text for seen state header" = "คนที่ดู:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "อ่านเมื่อ %1$@ ใกล้กับ %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "ดู %1$@";

"Select country code|select country code text" = "เลือกรหัสประเทศ";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "ส่งไปที่โทรศัพท์ แชท และเว็บ";

"Send|Nav bar send button text" = "ส่ง";

"Send|Send button for voice message" = "ส่ง";

"Send|text to show in the send button" = "ส่ง";

"Sending...|sending progress text" = "กำลังส่ง...";

"Sent a message|default notification text for messages with no body text" = "ส่งข้อความแล้ว";

"Sent from Messenger|indicator that a message was sent from Messenger" = "ส่งจาก Messenger";

"Sent from email|indicator that a message was sent from email" = "ส่งจากอีเมล";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "ส่งจากมือถือ";

"Sent from web|indicator that a message was sent sent from web or chat" = "ส่งจากเว็บ";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "ส่งจาก %1$@";

"Session Expired|Error title for expired session" = "เซสชันหมดอายุ";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "การตั้งค่าแอป > ทั่วไป > บริการตำแหน่งที่ตั้ง";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "การตั้งค่าแอป > บริการตำแหน่งที่ตั้ง";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "การตั้งค่า แอพ - ความเป็นส่วนตัว - บริการตำแหน่งที่ตั้ง";

"Settings|Settings alert popup button" = "การตั้งค่า";

"Settings|title for settings page" = "การตั้งค่า";

"Settings|title of settings tab" = "การตั้งค่า";

"Share|Share button title" = "แชร์";

"Shared a link|text for a link share" = "แชร์ลิงก์";

"Shared a photo|text for a photo share" = "แชร์รูปภาพ";

"Shared a video|text for a video share" = "แชร์วิดีโอ";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "ลงทะเบียน Facebook";

"Skip|Skip - Skip Button Title" = "ข้าม";

"Something went wrong. Want to try again?|retry dialog message" = "มีบางอย่างผิดปกติ ต้องการลองอีกครั้งหรือไม่?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "ขออภัย มีบางอย่างผิดปกติ";

"Start Group Chats|Call to action for Group Chat NUX slide" = "เริ่มแชทแบบกลุ่ม";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "หยุดแนบสื่อ";

"Stop|Stop button for voice recording" = "หยุด";

"Submit|Submit button title" = "ส่ง";

"Switch Account|text for switching logged in user" = "เปลี่ยนบัญชีผู้ใช้";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "สลับไปใช้ Wi-Fi เพื่อโทร";

"Take Photo|action sheet option for taking a photo" = "ถ่ายภาพ";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "แตะ \"ลองอีกครั้ง\" เพื่อส่งข้อความนี้";

"Tap gear to turn on chat|placeholder in search bar when offline" = "แตะรูปเฟืองเพื่อเปิดการแชท";

"Tap to discover who's in the area|Message of in-app notification explaining that user can tap to learn more about sharing location." = "แตะเพื่อค้นพบว่าใครอยู่ในพื้นที่";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "แตะเพื่อกลับไปยังการสนทนา";

"Tap to send a message|Message of in-app notification explaining that user can tap to message to nearby friends." = "แตะเพื่อส่งข้อความ";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "แตะเพื่อเปิดตำแหน่งที่ตั้ง";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "ไม่สามารถส่งข้อความถึงหมายเลขนั้น";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "ส่งข้อความถึงเพื่อนไม่ว่าพวกเขาจะอยู่ที่ไหน ในโทรศัพท์หรือแชท";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "หมายเลขโทรศัพท์นั้นไม่ได้รับอนุญาตให้รับข้อความ";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "มีปัญหาในการเชื่อมต่อกับ Facebook โปรดตรวจสอบการเชื่อมต่อของคุณแล้วลองอีกครั้ง";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "มีปัญหาเกิดขึ้นในการเชื่อมต่อการโทรของคุณ โปรดเชื่อมต่อกับ Wi-Fi แล้วลองอีกครั้ง";

"This Conversation|header text for alert settings applying to a single conversation" = "การสนทนานี้";

"Timeline|Button text to go to a user's timeline" = "ไทม์ไลน์";

"Timeline|divebar timeline button title" = "ไทม์ไลน์";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "เคล็ดลับ: ไม่พลาดสักข้อความ";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "ในการรับสาย คุณต้องอัพเดตเป็น Messenger เวอร์ชันใหม่";

"To complete your phone number activation, please enter the activation code|" = "ในการเปิดใช้งานหมายเลขโทรศัพท์ โปรดป้อนรหัสเปิดใช้งาน";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "ในการรวมตำแหน่งที่ตั้งในข้อความ ให้ไปที่ %1$@ ของคุณ";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "ในการโทร คุณต้องอัพเดตเป็น Messenger เวอร์ชันใหม่";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "ในการปิดการเตือนสำหรับการสนทนานี้ ให้ไปที่ตั้งค่าการสนทนา";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "ในการปิดตำแหน่งที่ตั้งสำหรับการสนทนาทั้งหมดของคุณ ให้ไปที่ %1$@ ของคุณ";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications" = "ในการเปิดการแจ้งเตือน ไปที่การตั้งค่า iPhone %1$@ การแจ้ง %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "ในการใช้คุณสมบัตินี้ ไปที่การตั้งค่า %1$@ ของคุณแล้วเลือกบริการค้นหาตำแหน่ง เลือก เปิด สำหรับ Facebook";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "ในการใช้คุณสมบัตินี้ ไปที่การตั้งค่า %1$@ ของคุณแล้วแตะ ความเป็นส่วนตัว จากนั้น บริการตำแหน่งที่ตั้ง เลือก เปิด สำหรับ Facebook";

"To|Accessibility label for to field in contact picker" = "ถึง";

"To:|to field in contact picker" = "ถึง:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "สัมผัสค้างไว้เพื่อพูด\nปล่อยเพื่อส่ง หรือเลื่อนออกจากปุ่มเพื่อยกเลิก";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "ลองอีกครั้ง";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "ปิดการแชท";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "ปิดจนถึงเวลา 8.00 น.";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "ปิดเป็นเวลา 1 ชม.";

"Turn Off|Option to turn off alerts" = "ปิด";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "เปิดการแชท";

"Turn On Location Services|Error message title when location services are unavailable." = "เปิดบริการตำแหน่งที่ตั้ง";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "เปิดการแจ้งเตือน";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "เปิดการแจ้งเตือน";

"Turn On|Option to turn on alerts" = "เปิด";

"Turn On|Turn on alerts" = "เปิด";

"Turn On|button label for deferring enabling push notifications" = "เปิด";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "เปิดการแจ้งเตือน";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "เปิดการแจ้งเตือนเพื่อทราบเมื่อมีข้อความใหม่";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "กำลังพิมพ์…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "ไม่สามารถโทรไปยัง %1$@ ได้";

"Unable to Play Voice Message|The message to show when user receives a voice message but his app doesn't support playing it back." = "ไม่สามารถเล่นข้อความเสียงได้";

"Unable to Save Image|retry dialog title for setting thread image" = "ไม่สามารถบันทึกรูปภาพ";

"Unable to Send|Title for send feedback failed warning." = "ไม่สามารถส่งได้";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "ไม่สามารถเพิ่มบุคคลในการสนทนาได้อีก โปรดลองอีกครั้ง";

"Unable to name your conversation.|error message after setting conversation name" = "ไม่สามารถตั้งชื่อการสนทนาของคุณ";

"Unable to remove you right now.|error messages after leaving conversation" = "ไม่สามารถลบคุณออกในขณะนี้";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "ไม่สามารถบันทึกรายการโปรดข้อความใน Facebook ได้";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "ไม่สามารถส่งข้อความ ลองใหม่?";

"Unable to send message.|Alert text for when a message failed to send." = "ไม่สามารถส่งข้อความ";

"Unable to send right now.|error message for failing to send message" = "ไม่สามารถส่งในขณะนี้";

"Unpin|button title to remove user from favorites" = "เลิกปักหมุด";

"Update|Get new version now button." = "อัพเดต";

"Updating...|updating progress text" = "กำลังอัพเดต...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "อัพเกรดเดี๋ยวนี้";

"Use|use nav bar button in photo preview screen" = "ใช้";

"View Call|Text show on button that views an incoming call" = "ดูสาย";

"View in Maps|action sheet option for viewing a map" = "ดูในแผนที่";

"View|Alert button that takes user to the thread where a message failed to send" = "ดู";

"We'll text you a link to confirm your number.|Confirmation information text" = "เราจะส่งลิงก์ให้คุณยืนยันหมายเลขของคุณ";

"Welcome to Messenger|Title for NUX page" = "ยินดีต้อนรับสู่ Messenger";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "คุณต้องการส่งข้อความนี้ถึงใคร?";

"You can control this in your privacy settings.|Explanation to let user know he can change settings of sharing location." = "คุณสามารถควบคุมการตั้งค่านี้ได้ในการตั้งค่าความเป็นส่วนตัว";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "อีกสักครู่คุณจะได้รับ SMS หรืออีเมลที่มีรหัสสำหรับใช้เข้าสู่ระบบ";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "คุณจะไม่ทราบเมื่อคุณได้รับข้อความ";

"Your carrier doesn't allow calling with Messenger. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if carrier doesn't allowVOIP and not on wifi" = "ผู้ให้บริการเครือข่ายของคุณไม่อนุญาตให้โทรด้วย Messenger โปรดเปิด Wi-Fi ในการตั้งค่าโทรศัพท์ของคุณ";

"Your message was not sent.|text shown when a message failed to send" = "ข้อความของคุณไม่ถูกส่ง";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "ข้อความของคุณไม่ถูกส่ง";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "…";

"active 1d ago|indicator that a user was active 1 day ago" = "ใช้งานเมื่อ 1 วันที่แล้ว";

"active 1h ago|indicator that a user was active 1 hour ago" = "ใช้งานเมื่อ 1 ชั่วโมงที่แล้ว";

"active 1m ago|indicator that a user was active 1 minute ago" = "ใช้งานเมื่อ 1 นาทีที่แล้ว";

"active now|indicator that a user is currently active, on web or mobile" = "ใช้งานอยู่ในขณะนี้";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "ใช้งานบนมือถือเมื่อ %1$@ ที่แล้ว";

"active on mobile|presences status for being active on mobile" = "ใช้งานบนมือถือ";

"active %id ago|indicator that a user was active 2+ days ago" = "ใช้งานเมื่อ %1$i วันที่แล้ว";

"active %ih ago|indicator that a user was active 2+ hours ago" = "ใช้งานเมื่อ %1$i ชั่วโมงที่แล้ว";

"active %im ago|indicator that a user was active 2+ minute ago" = "ใช้งานเมื่อ %1$i นาทีที่แล้ว";

"active %@ ago|presences status for being active a relative time ago" = "ใช้งานเมื่อ %1$@ ที่แล้ว";

"error|A short message for audio play error" = "ข้อผิดพลาด";

"is calling|text below the caller's name when they are calling" = "กำลังโทรหา";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "กำลังพิมพ์…";

"on mobile|presences status for being available on mobile" = "บนมือถือ";

"online %@ ago|presences status for being online on the web a relative time ago" = "ออนไลน์ %1$@ ที่แล้ว";

"online|presences status for being online on the web" = "ออนไลน์";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "กำลังพิมพ์…";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d จาก %2$d";

"%i Friend of Friends|Number of friends of friends in search result (singular)" = "เพื่อนของเพื่อน %1$i คน";

"%i Friend|Number of friends in search result (singular)" = "เพื่อน %1$i คน";

"%i Friends of Friends|Number of friends of friends in search result (plural)" = "เพื่อนของเพื่อน %1$i คน";

"%i Friends|Number of friends in search result (plural)" = "เพื่อน %1$i คน";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i วัน";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i ชั่วโมง";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i นาที";

"%id|short indicator that a user was active 2+ days ago" = "%1$i วัน";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$i ชม.";

"%im|short indicator that a user was active 2+ minute ago" = "%1$i นาที";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@  •  %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ และ %2$@ ใช้ Facebook Messenger";

"%@ are Nearby|Title of in-app notification showing some friends are nearby. E.g. Tom, Jerry, +2 are Nearby" = "%1$@ อยู่ใกล้เคียง";

"%@ is Nearby|Title of in-app notification showing some friend is nearby. E.g. Tom is Nearby" = "%1$@ อยู่ใกล้เคียง";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ กำลังโทร";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ กำลังอยู่ในสายอื่น";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ ไม่ว่าง";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ กำลังพิมพ์…";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ ได้พยายามโทรถึงคุณ";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ ใช้ Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, อีก %2$i";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ และ %3$@ ใช้ Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ และเพื่อนอีก 1 คนใช้ Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ และเพื่อนอีก %4$i คนใช้ \nMessenger";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@…";

"%u Friend is Nearby|Title of in-app notification showing some friend is nearby. E.g. 1 Friend is Nearby" = "เพื่อน %1$u คนอยู่ใกล้เคียง";

"%u Friends are Nearby|Title of in-app notification showing some friends are nearby. E.g. 2 Friends are Nearby" = "เพื่อน %1$u คนอยู่ใกล้เคียง";

"%u Friends are Nearby|Title of megaphone to encourage user to share location. E.g. 2 Friends are Nearby." = "เพื่อน %1$u คนอยู่ใกล้เคียง";

"%u of your friends are sharing when they're nearby|Message to let user know how many of his friends are sharing location." = "เพื่อนของคุณ %1$u คนกำลังแชร์เมื่อพวกเขาอยู่ใกล้เคียง";

"%u photo attached|Accessiblity text for a single photo" = "แนบรูปภาพ %1$u รูป";

"%u photos attached|Accessibility text for a photo set" = "แนบรูปภาพ %1$u รูป";

